package am.martirosyan.mydeliver.bot.user;

public class UserMessage {
    public final static String WELCOME_MESSAGE = """
            🎉 Добро пожаловать в MyDeliver! 🍔\s
            🚀Здесь вы можете заказать доставку еды из любимых ресторанов города🏙️🍕
            """;

    public final static String REGISTRATION_MESSAGE = """
           Для начала работы введите ваш номер телефона, используя клавиатуру📲
           """;

    public static final String REGISTRATION_SUCCESS_MESSAGE = """
            ✅ Регистрация завершена!\s
            Добро пожаловать в MyDeliver! 🍽️🚀\s
            Теперь вы можете оформить заказ и наслаждаться вкусной едой😋\s
            Чтобы начать, выберите ресторан из меню📍""";
    ;
}
